tests/cases/crystallization/constant/moldingDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | moldingFoam: injection molding solver modules
   \\      /  Website      | https://openfoam.org
    \\  /    A nd          | Copyright (C) 2026 Yuki Lu
     \\/     M anipulation |
-------------------------------------------------------------------------------
Description
    Stefan benchmark: the process groups are present only because moldingFoam
    requires them; no boundary uses the stage, so the run is a pure
    conduction/solidification problem. The ejection temperature is
    unreachable.
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      moldingDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

injection
{
    meltTemperature  392;
}

packing
{
    switchFraction   1;
    switchPressure   1e9;

    pressure
    {
        type            constant;
        value           1e5;
    }
}

cooling
{
    ejectionTemperature  50;
    releasePressure      1e5;
}

viscousDissipation  false;

// Nakamura/Avrami crystallisation: the latent heat is released through
// the relative crystallinity field chi instead of the hMelt platform
crystallization
{
    avramiExponent    2;
    rateConstant      0.1;     // [1/s] at the peak temperature
    peakTemperature   400;     // [K]
    windowWidth       40;      // [K] full width at half maximum
    latentHeat        2e5;     // [J/kg]
    rho               800;     // [kg/m^3]
}


// ************************************************************************* //
