tests/cases/crystallization/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | moldingFoam: injection molding solver modules
   \\      /  Website      | https://openfoam.org
    \\  /    A nd          | Copyright (C) 2026 Yuki Lu
     \\/     M anipulation |
-------------------------------------------------------------------------------
Description
    controlDict for the Stefan benchmark: 100 s of physical time at a fixed
    0.02 s step (implicit conduction), fields written every 20 s for the
    freeze-front comparison.
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          moldingFoam;

libs            ("libmoldingFoam.so");

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         40;

deltaT          0.02;

writeControl    adjustableRunTime;

writeInterval   5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable no;

adjustTimeStep  off;

functions
{
    moldTemperature
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   1;
        writeFields     no;
        log             true;
        patch           coldWall;
        operation       areaAverage;
        fields          (T);
    }
}

// ************************************************************************* //
