tests/cases/crystallization/system/expectedPatterns
moldingFoam: crystallinity: max\(chi\)
End
