tests/cases/crystallization/system/verifyScript
verify-crystallization.py
